{
  "statutoryHolidays": [
    {
      "name": "New Year's Day",
      "spanishName": "Año Nuevo",
      "date": "01-01",
      "remarks": "First day of the year."
    },
    {
      "name": "Constitution Day",
      "spanishName": "Día de la Constitución",
      "date": "02-05",
      "remarks": ""
    },
    {
      "name": "Benito Juárez's Birthday",
      "spanishName": "Natalicio de Benito Juárez",
      "date": "03-21",
      "remarks": ""
    },
    {
      "name": "Labour Day",
      "spanishName": "Día del Trabajo",
      "date": "05-01",
      "remarks": "Established in 1923, Labor Day commemorates the Mexican workers' union movements."
    },
    {
      "name": "Independence Day",
      "spanishName": "Día de la Independencia",
      "date": "09-16",
      "remarks": "Commemorates the start of the Independence War by Priest Miguel Hidalgo y Costilla in 1810. Festivities begin the evening of September 15 and culminate with a military parade on September 16."
    },
    {
      "name": "Revolution Day",
      "spanishName": "Día de la Revolución",
      "date": "11-20",
      "remarks": ""
    },
    {
      "name": "Christmas Day",
      "spanishName": "Navidad",
      "date": "12-25",
      "remarks": "Christmas celebration; secular and religious holiday."
    }
  ],
  "civicHolidays": [
    {
      "date": "February 20",
      "name": "Mexican Army Day",
      "spanishName": "Día del Ejército",
      "remarks": "Celebrates the Mexican Army on the date of its 1913 foundation and honor of the 1911 Loyalty March ('Marcha de la Lealtad'), when President Madero was escorted by the Cadets of the Military College to the National Palace."
    },
    {
      "date": "February 24",
      "name": "Flag Day",
      "spanishName": "Día de la Bandera",
      "remarks": "Celebrates the current Flag of Mexico and honors the previous ones. Flag Day was implemented by President Lázaro Cárdenas in 1937."
    },
    {
      "date": "March 18",
      "name": "Anniversary of the Oil Expropriation",
      "spanishName": "Aniversario de la Expropiación petrolera",
      "remarks": "Celebrates the Oil Expropriation by President General Lázaro Cárdenas in 1938."
    },
    {
      "date": "April 21",
      "name": "Heroic Defense of Veracruz",
      "spanishName": "Heroica Defensa de Veracruz",
      "remarks": "Commemorates the defense against the United States occupation of Veracruz in 1914 by cadets, staff and faculty of the Heroica Escuela Naval Militar and personnel of the Mexican Navy."
    },
    {
      "date": "May 5",
      "name": "Fifth of May",
      "spanishName": "Cinco de Mayo",
      "remarks": "Celebrates the victory of the Mexican Army, led by Gral. Ignacio Zaragoza against French forces in the city of Puebla, on May 5, 1862. Also widely celebrated in the United States."
    },
    {
      "date": "May 8",
      "name": "Miguel Hidalgo's birthday",
      "spanishName": "Natalicio de Miguel Hidalgo",
      "remarks": "Commemorates the birth in 1753 of Miguel Hidalgo y Costilla, the initiator of the Mexican Independence War."
    },
    {
      "date": "June 1",
      "name": "National Maritime Day",
      "spanishName": "Día de la Marina",
      "remarks": "Honors the merchant marines, which began on June 1, 1917 with the Tabasco. The holiday was first celebrated in 1942 to honor the crews of the Potrero del Llano and Faja de Oro, whose ships were sunk by Nazi submarines in May 1942."
    },
    {
      "date": "September 13",
      "name": "Anniversary of the 'Boy Heroes' or 'Heroic Cadets'",
      "spanishName": "Día de los Niños Héroes",
      "remarks": "Celebrates the Battle of Chapultepec during the Mexican–American War of 1847 and the heroic and ultimate sacrifice that the Niños Héroes gave for the nation."
    },
    {
      "date": "September 16",
      "name": "Cry of Dolores",
      "spanishName": "Grito de Dolores",
      "remarks": "Celebrates the Grito de Dolores, an event that marked the start of the independence war against Spain on the eve of September 16, 1810. It took place at a church chapel in Dolores Hidalgo, Guanajuato, led by a Creole Catholic priest Miguel Hidalgo y Costilla. Families and friends gather the evening of September 15 for a Noche Mexicana, dressing in traditional clothes and consuming traditional foods and drinks such as pozole, mole, birria, beer, tequila, and/or mezcal. The President rings the bell of Hidalgo and crowds gather in the Zócalo of Mexico City to shout ¡Viva México! (Long live Mexico!). Similar ceremonies are held in every state and municipality across the country. A military parade is held in Mexico City on September 16."
    },
    {
      "date": "September 27",
      "name": "Culmination of the Mexican War of Independence",
      "spanishName": "Consumación de la Independencia",
      "remarks": "Celebrates the end of the Mexican Independence War in 1821, 11 years after Father Hidalgo started it, with the victory of the Army of the Three Guarantees, led by Agustín de Iturbide and Vicente Guerrero."
    },
    {
      "date": "September 30",
      "name": "Morelos' birthday",
      "spanishName": "Natalicio de José Mª Morelos y Pavón",
      "remarks": "Commemorates the birth in 1765 of Father José María Morelos y Pavón, one of the founding fathers of the Mexican nation."
    },
    {
      "date": "October 12",
      "name": "Columbus Day",
      "spanishName": "Día de la Raza",
      "remarks": "Commemorates the creation of a new, brown race of mixed American, European, and African ancestry following the European colonization of the Americas that began in 1492."
    },
    {
      "date": "November 23",
      "name": "Mexican Navy Day",
      "spanishName": "Dia de la Armada de Mexico",
      "remarks": "Celebrating the 1825 capture of the San Juan de Ulúa Fortress in Veracruz led by a joint force of Mexican Army and Navy units (the capture of the fortress is the Navy's baptism of fire, on which its first fleet under Captain Pedro Sainz de Baranda served with distinction)."
    }
  ],
  "festivities": []
}
