{
  "statutoryHolidays": [
    {
      "name": "New Year's Day",
      "spanishName": "Año Nuevo",
      "date": "01-01",
      "remarks": "First day of the year."
    },
    {
      "name": "Constitution Day",
      "spanishName": "Día de la Constitución",
      "date": "02-05",
      "remarks": ""
    },
    {
      "name": "Benito Juárez's Birthday",
      "spanishName": "Natalicio de Benito Juárez",
      "date": "03-21",
      "remarks": ""
    },
    {
      "name": "Labour Day",
      "spanishName": "Día del Trabajo",
      "date": "05-01",
      "remarks": "Established in 1923, Labor Day commemorates the Mexican workers' union movements."
    },
    {
      "name": "Independence Day",
      "spanishName": "Día de la Independencia",
      "date": "09-16",
      "remarks": "Commemorates the start of the Independence War by Priest Miguel Hidalgo y Costilla in 1810. Festivities begin the evening of September 15 and culminate with a military parade on September 16."
    },
    {
      "name": "Revolution Day",
      "spanishName": "Día de la Revolución",
      "date": "11-20",
      "remarks": ""
    },
    {
      "name": "Christmas Day",
      "spanishName": "Navidad",
      "date": "12-25",
      "remarks": "Christmas celebration; secular and religious holiday."
    }
  ],
  "civicHolidays": [
    {
      "date": "February 20",
      "name": "Mexican Army Day",
      "spanishName": "Día del Ejército",
      "remarks": "Celebrates the Mexican Army on the date of its 1913 foundation and honor of the 1911 Loyalty March ('Marcha de la Lealtad'), when President Madero was escorted by the Cadets of the Military College to the National Palace."
    },
    {
      "date": "February 24",
      "name": "Flag Day",
      "spanishName": "Día de la Bandera",
      "remarks": "Celebrates the current Flag of Mexico and honors the previous ones. Flag Day was implemented by President Lázaro Cárdenas in 1937."
    },
    {
      "date": "March 18",
      "name": "Anniversary of the Oil Expropriation",
      "spanishName": "Aniversario de la Expropiación petrolera",
      "remarks": "Celebrates the Oil Expropriation by President General Lázaro Cárdenas in 1938."
    },
    {
      "date": "April 21",
      "name": "Heroic Defense of Veracruz",
      "spanishName": "Heroica Defensa de Veracruz",
      "remarks": "Commemorates the defense against the United States occupation of Veracruz in 1914 by cadets, staff and faculty of the Heroica Escuela Naval Militar and personnel of the Mexican Navy."
    },
    {
      "date": "May 5",
      "name": "Fifth of May",
      "spanishName": "Cinco de Mayo",
      "remarks": "Celebrates the victory of the Mexican Army, led by Gral. Ignacio Zaragoza against French forces in the city of Puebla, on May 5, 1862. Also widely celebrated in the United States."
    },
    {
      "date": "May 8",
      "name": "Miguel Hidalgo's birthday",
      "spanishName": "Natalicio de Miguel Hidalgo",
      "remarks": "Commemorates the birth in 1753 of Miguel Hidalgo y Costilla, the initiator of the Mexican Independence War."
    },
    {
      "date": "June 1",
      "name": "National Maritime Day",
      "spanishName": "Día de la Marina",
      "remarks": "Honors the merchant marines, which began on June 1, 1917 with the Tabasco. The holiday was first celebrated in 1942 to honor the crews of the Potrero del Llano and Faja de Oro, whose ships were sunk by Nazi submarines in May 1942."
    },
    {
      "date": "September 13",
      "name": "Anniversary of the 'Boy Heroes' or 'Heroic Cadets'",
      "spanishName": "Día de los Niños Héroes",
      "remarks": "Celebrates the Battle of Chapultepec during the Mexican–American War of 1847 and the heroic and ultimate sacrifice that the Niños Héroes gave for the nation."
    },
    {
      "date": "September 16",
      "name": "Cry of Dolores",
      "spanishName": "Grito de Dolores",
      "remarks": "Celebrates the Grito de Dolores, an event that marked the start of the independence war against Spain on the eve of September 16, 1810. It took place at a church chapel in Dolores Hidalgo, Guanajuato, led by a Creole Catholic priest Miguel Hidalgo y Costilla. Families and friends gather the evening of September 15 for a Noche Mexicana, dressing in traditional clothes and consuming traditional foods and drinks such as pozole, mole, birria, beer, tequila, and/or mezcal. The President rings the bell of Hidalgo and crowds gather in the Zócalo of Mexico City to shout ¡Viva México! (Long live Mexico!). Similar ceremonies are held in every state and municipality across the country. A military parade is held in Mexico City on September 16."
    },
    {
      "date": "September 27",
      "name": "Culmination of the Mexican War of Independence",
      "spanishName": "Consumación de la Independencia",
      "remarks": "Celebrates the end of the Mexican Independence War in 1821, 11 years after Father Hidalgo started it, with the victory of the Army of the Three Guarantees, led by Agustín de Iturbide and Vicente Guerrero."
    },
    {
      "date": "September 30",
      "name": "Morelos' birthday",
      "spanishName": "Natalicio de José Mª Morelos y Pavón",
      "remarks": "Commemorates the birth in 1765 of Father José María Morelos y Pavón, one of the founding fathers of the Mexican nation."
    },
    {
      "date": "October 12",
      "name": "Columbus Day",
      "spanishName": "Día de la Raza",
      "remarks": "Commemorates the creation of a new, brown race of mixed American, European, and African ancestry following the European colonization of the Americas that began in 1492."
    },
    {
      "date": "November 23",
      "name": "Mexican Navy Day",
      "spanishName": "Dia de la Armada de Mexico",
      "remarks": "Celebrating the 1825 capture of the San Juan de Ulúa Fortress in Veracruz led by a joint force of Mexican Army and Navy units (the capture of the fortress is the Navy's baptism of fire, on which its first fleet under Captain Pedro Sainz de Baranda served with distinction)."
    }
  ],
   "festivities": [
    {
      "date": "January 6",
      "name": "Epiphany",
      "spanishName": "Día de los Reyes Magos",
      "remarks": "Celebrates the Biblical New Testament story of the arrival of the three wise men who each brought a gift to the Christ child. Traditionally, children receive toys, and people buy a pastry called rosca de reyes. Anyone who bites into the bread and finds a figurine of the Christ child must host a party for the Day of Candlemas (February 2). It is not a state holiday."
    },
    {
      "date": "February 2",
      "name": "Candlemas",
      "spanishName": "Día de la Candelaria",
      "remarks": "Celebrates the presentation of the baby Jesus in the Temple of Jerusalem 40 days after his birth. Traditionally, women bring a representation (i.e. statue/doll) of the baby Jesus in new clothes to be blessed by the parish priest. Afterwards, a meal of tamales and hot chocolate is given by the person who found the baby Jesus figure in the Rosca de Reyes (see above in Epiphany). It is not a state holiday."
    },
    {
      "date": "Thursday to Tuesday before Ash Wednesday",
      "name": "Carnival",
      "spanishName": "Carnaval",
      "remarks": "In addition to costumes, music, and dancing, Carnaval celebrations often include amusement rides, bull riding, or Charreadas (rodeos). The largest carnavales are in Mazatlán and Veracruz. While most carnivals are held during the week before Lent, they can be held at any time of the year."
    },
    {
      "date": "February 14",
      "name": "Valentine's Day",
      "spanishName": "Día del Amor y la Amistad",
      "remarks": "Celebrates amorous unions. On this day, traditionally, people give chocolates, flowers, letters and gifts to their friends, relatives and couples. It is not a state holiday."
    },
    {
      "date": "March 8",
      "name": "International Women's Day",
      "spanishName": "Día Internacional de la Mujer",
      "remarks": "It is not a state holiday."
    },
    {
      "date": "March or April",
      "name": "Holy Thursday",
      "spanishName": "Jueves Santo",
      "remarks": "Commemorates the Last Supper of Christ. Government offices, schools, and many businesses close; many families celebrate it as a secular holiday. Many families visit the beaches. It is not a state holiday."
    },
    {
      "date": "March or April",
      "name": "Good Friday",
      "spanishName": "Viernes Santo",
      "remarks": "Commemorates the Crucifixion of Jesus. Government offices, schools, and many businesses close; many families celebrate it as a secular holiday. Many families visit the beaches. It is not a state holiday."
    },
    {
      "date": "April 30",
      "name": "Children's Day",
      "spanishName": "Día del Niño",
      "remarks": "Honors all the children. It is not a state holiday."
    },
    {
      "date": "May 10",
      "name": "Mother's Day",
      "spanishName": "Día de las Madres",
      "remarks": "Honors all the mothers throughout the country. It is not a state holiday."
    },
    {
      "date": "May 15",
      "name": "Teacher's Day",
      "spanishName": "Día del Maestro",
      "remarks": "Honors all the teachers throughout the country. It is often celebrated on the Monday before May 15. It is not a state holiday."
    },
    {
      "date": "May 23",
      "name": "Students' Day",
      "spanishName": "Día del estudiante",
      "remarks": "Honors all the students throughout the country. It is not a state holiday."
    },
    {
      "date": "Third Sunday of June",
      "name": "Father's Day",
      "spanishName": "Día del Padre",
      "remarks": "Honors all the fathers throughout the country. It is not a state holiday."
    },
    {
      "date": "November 1",
      "name": "All Saints' Day (Day of the Dead)",
      "spanishName": "Día de Todos los Santos",
      "remarks": "Honors dead relatives and friends (who were under 18 years of age and unmarried) with candles, food and flower offerings, altars, and pre-Columbian and Christian rituals. It is not a state holiday."
    },
    {
      "date": "November 2",
      "name": "All Souls' Day (Day of the Dead)",
      "spanishName": "Día de Muertos",
      "remarks": "Honors dead relatives and friends (who were 18 years of age or married) with candles, food and flower offerings, altars, and pre-Columbian and Christian rituals. It is not a state holiday."
    },
    {
      "date": "December 12",
      "name": "Feast of Our Lady of Guadalupe",
      "spanishName": "Día de la Virgen de Guadalupe",
      "remarks": "Celebrates the day that Our Lady of Guadalupe appeared on Tepeyac hill to the native San Juan Diego Cuauhtlatoatzin. It is not a state holiday."
    },
    {
      "date": "December 16–24",
      "name": "Las Posadas",
      "spanishName": "Las Posadas",
      "remarks": "Commemorates the Biblical New Testament story of Joseph and Mary's search for shelter in Bethlehem. Consists of candlelight processions as well as stops at various nativity scenes. Children break piñatas and people drink ponche ('punch'). Many businesses hold a posada (meaning 'inn' in English) as a year-end Christmas party for their employees."
    },
    {
      "date": "December 24",
      "name": "Christmas Eve",
      "spanishName": "Nochebuena",
      "remarks": "Celebrates the eve of the nativity of Jesus, as both a secular and religious winter holiday. The traditional treats for this holiday are buñuelos, tamales and atole or champurrado. Sometimes they eat gelatina de colores (different flavors of Jell-O and a milk-based Jell-O mixed together to make a colorful treat) Las Posadas are celebrated nine days before Nochebuena, usually accompanied by a piñata party for children and dance music for adults. Many families feast, with pozole or turkey as common dishes."
    },
    {
      "date": "December 25",
      "name": "Christmas",
      "spanishName": "Navidad",
      "remarks": "Christmas celebration; secular and religious holiday. Government offices, schools, and most business close from December 25 to January 1, and many people go on vacation to visit relatives or enjoy the beach."
    },
    {
      "date": "December 28",
      "name": "Holy Innocents Day",
      "spanishName": "Día de los Santos Inocentes",
      "remarks": "On this day, people pull practical jokes on each other. It is equivalent to the U.S. version of April Fools' Day (April 1). People must not believe anything that other people say nor let them borrow any amount of money. If any person has fallen victim of the joke, the person pulling the joke will say ¡Inocente palomita...!, literally meaning 'Innocent little dove..!!!' (equivalent to saying April Fools!)."
    },
    {
      "date": "December 31",
      "name": "New Year's Eve",
      "spanishName": "Víspera de Año Nuevo",
      "remarks": "Mexicans celebrate New Year's Eve or locally known as Año Nuevo, by downing a grape with each of the twelve chimes of the bell during the midnight countdown, while making a wish with each one. Mexican families decorate homes and parties, during New Year's, with colors such as red, to encourage an overall improvement of lifestyle and love, yellow to encourage blessings of improved employment conditions, green to improve financial circumstances and white to improved health. Mexican sweet bread is baked with a coin or charm hidden in the dough. When the bread is served, the recipient whose slice contains the coin or charm is believed to be blessed with good luck in the new year. Another tradition is making a list of all the bad or unhappy events from the current year; before midnight, this list is thrown into a fire, symbolizing the removal of negative energy from the new year. At the same time, thanks is expressed for all the good things had during the year that is coming to its end so that they will continue to be had in the new year. Mexicans celebrate by having a dinner with their families, the traditional meal being turkey and mole, a tradition which has now spanned worldwide. Those who want to party generally go out afterwards, to local parties or night clubs. If you're in Mexico, you can still enjoy festivities in the street. In Mexico City there is a huge street festival on New Year's Eve; celebrations center around the Zocalo, the city's main square. One can expect a lot of firecrackers, fireworks and sparklers being fired. At midnight there is a lot of noise and everyone shouts: 'Feliz año nuevo!' People embrace, make noise, set off firecrackers, and sing."
    }
  ]
}
